Masmiseim36/nxpSDK/boards/mimxrt700evk/demo_apps/power_mode_with_hifi/cm33_core0/hardware_init.c
    if (IS_XIP_XSPI1() == 0U)
    {
        port = 5U;
        for (pin = 0U; pin <= 20U; pin++)
        {
            IOPCTL_PinMuxSet(port, pin, 0U);
        }
    }
}

/*!
 * @brief API to perform a dummy read to the selected SRAM partitions. SRAM auto clock gating can save power if
 * partitions are parked on the core for their domain (CPU0 for RAM arbiter0 and CPU1 for RAM
 * arbiter1). This function will perform a dummy read to the specified RAM partitions to force the clock to
 * park on that core until another master accesses each partition.
 *
 * NOTE, make sure the caller is allowed to access the given SRAM partition, otherwise the system may hang!
 *
 * @param pt SRAM Partition, 0-17 for RAM arbiter0, 18-29 for RAM arbiter1.
 *
 */
void POWER_SramDummyRead(uint32_t pt)
{
    uint32_t dummy;
    const uint32_t sram_addr[30] = {0x20000000, 0x20008000, 0x20010000, 0x20018000, 0x20020000, 0x20030000,
                                    0x20040000, 0x20060000, 0x20080000, 0x200C0000, 0x20100000, 0x20180000,
                                    0x20200000, 0x20300000, 0x20400000, 0x20480000, 0x20500000, 0x20540000,
                                    0x20580000, 0x20588000, 0x20590000, 0x20598000, 0x205A0000, 0x205B0000,
                                    0x205C0000, 0x205E0000, 0x20600000, 0x20680000, 0x20700000, 0x20740000};

#if defined(XCACHE0) /* Only CPU0 has cache. */
    bool enabled = false;

    /*Disable cache, only disable if it's enabled. */
    if (XCACHE_CCR_ENCACHE_MASK == (XCACHE_CCR_ENCACHE_MASK & XCACHE0->CCR))
    {
        enabled = true;
        XCACHE_DisableCache(XCACHE0);
    }
#endif
    dummy = *((volatile uint32_t *)(sram_addr[pt]));
    dummy++;         /* suppress warning. */
#if defined(XCACHE0) /* Only CPU0 has cache. */
    /*Disable cache, only disable if it's enabled. */
    if (enabled)
    {
        XCACHE_EnableCache(XCACHE0);
    }
#endif
}

void BOARD_BootDSP(void)
{
    /* Boot HIFI4. */
    CLKCTL0->FRO0MAXDOMAINEN |= CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_VDD2_DSP_MASK;
    BOARD_DSP_Init(2U, 1U, true); /* Select FRO0_MAX divider by 1 for HIFI clock. */
}

void BOARD_StopDSP(void)
{
    uint32_t i;
    DSP_Stop();

    /* Dummy read the SRAM partition to let SRAM partition's clock park on CM33. */
    for (i = DEMO_HIFI4_SRAM_PT_START; i <= DEMO_HIFI4_SRAM_PT_END; i++)
    {
        POWER_SramDummyRead(i);
    }

    DSP_Deinit();
    CLOCK_AttachClk(kNONE_to_DSP);
    CLKCTL0->FRO0MAXDOMAINEN &= ~CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_VDD2_DSP_MASK;
    POWER_EnablePD(kPDRUNCFG_PD_VDD2_DSP);
}

void BOARD_InitHardware(void)
{
    BOARD_ConfigMPU();
    BOARD_DisableIoPads();
    BOARD_InitPins();
    BOARD_BootClockRUN();

    DEMO_InitDebugConsole();

    /* BE CAUTIOUS TO SET CORRECT VOLTAGE RANGE ACCORDING TO YOUR BOARD/APPLICATION. PAD SUPPLY BEYOND THE RANGE DO
       HARM TO THE SILICON. */
    POWER_SetPio2VoltRange(kPadVol_300_360);

    /* Initialze power/clock configuration. */
    BOARD_InitPowerConfig();

    /* Boot and wait CPU1 booted. */
    APP_BootCore1();

    /* After the CPU1 booted, CPU0 relinquish the domain's control over the modules, and give the other domain exclusive
     * control. */
    BOARD_PowerConfigAfterCPU1Booted();

    BOARD_BootDSP();
}

#if DEMO_POWER_USE_PLL
void BOARD_DisablePll(void)
{
    /* Disable the PFD clock output first. */
    CLOCK_DeinitMainPfd(kCLOCK_Pfd0);
    CLOCK_DeinitAudioPfd(kCLOCK_Pfd3);
    /* Disable PLL. */
    CLOCK_DeinitMainPll();
    CLOCK_DeinitAudioPll();
}

void BOARD_RestorePll(void)
{
    /*Restore PLL*/
    BOARD_BootClockRUN_InitClockModule(kClockModule_MAIN_PLL0);
    BOARD_BootClockRUN_InitClockModule(kClockModule_AUDIO_PLL0);
}
#endif

/*! Disable clock for modules for cpu run only or sleep. */
static inline void BOARD_DisableClocks(void)
{
    CLOCK_DisableClock(kCLOCK_LPI2c15);

    CLOCK_DisableClock(kCLOCK_Gpio7);
    CLOCK_DisableClock(kCLOCK_Mu1);
    CLOCK_DisableClock(kCLOCK_Syscon0);
    CLOCK_DisableClock(kCLOCK_Syscon3);
    CLOCK_DisableClock(kCLOCK_Iopctl0);
    CLOCK_DisableClock(kCLOCK_Iopctl1);
    CLOCK_DisableClock(kCLOCK_Sema420);

#if (DEMO_POWER_USE_PLL == 0U) /* PLL located in VDDN. */
    if (!IS_XIP_XSPI0() && !IS_XIP_XSPI1())
    {
#if (DEMO_POWER_HIFI4_USED != 0U)
        CLOCK_EnableFro0ClkForDomain(kCLOCK_Vdd2CompDomainEnable | kCLOCK_Vdd2DspDomainEnable);
#else
        CLOCK_EnableFro0ClkForDomain(kCLOCK_Vdd2CompDomainEnable);
#endif /* DEMO_POWER_HIFI4_USED */
    }
#endif
    CLOCK_EnableFroClkOutput(FRO0, kCLOCK_FroDiv1OutEn);
}

static inline void BOARD_RestoreClocks(void)
{
    /* Restore clock, power for used modules. */
    CLOCK_EnableFroClkOutput(FRO0, kCLOCK_FroDiv1OutEn | kCLOCK_FroDiv3OutEn | kCLOCK_FroDiv6OutEn);
#if (DEMO_POWER_HIFI4_USED != 0U)
    CLOCK_EnableFro0ClkForDomain(kCLOCK_Vdd2CompDomainEnable | kCLOCK_VddnComDomainEnable | kCLOCK_Vdd2DspDomainEnable);
#else
    CLOCK_EnableFro0ClkForDomain(kCLOCK_Vdd2CompDomainEnable | kCLOCK_VddnComDomainEnable);
#endif

    CLOCK_EnableClock(kCLOCK_Syscon0);
    CLOCK_EnableClock(kCLOCK_Syscon3);
    CLOCK_EnableClock(kCLOCK_Iopctl0);
    CLOCK_EnableClock(kCLOCK_Iopctl1);
    CLOCK_EnableClock(kCLOCK_Mu1);
    CLOCK_EnableClock(kCLOCK_Sema420);
    CLOCK_EnableClock(kCLOCK_Gpio7);
    CLOCK_EnableClock(kCLOCK_LPI2c15);
}

void BOARD_RunActiveTest(void)
{
#if (DEMO_POWER_HIFI4_USED == 0U) || (DEMO_POWER_HIFI_PRINT_ENABLE == 0U)
    uint32_t pinCfg[3] = {0}; /* Used for IOPCTL configuration backup. */
#endif

    DEMO_LOG("\r\nThis test mode will keep CPU in run mode but close all other unused modules for a while.\n");
    DEMO_LOG("\r\nPlease don't input any charator until the mode finished.\n");

    /* Deinit unused modules. */
    BOARD_PMIC_I2C_Deinit();
    CLOCK_AttachClk(kNONE_to_LPI2C15);
#if (DEMO_POWER_HIFI4_USED == 0U) || (DEMO_POWER_HIFI_PRINT_ENABLE == 0U)
    DEMO_DeinitDebugConsole();
    CLOCK_AttachClk(kNONE_to_FCCLK0);

    pinCfg[0] = IOPCTL0->PIO[0][31];
    pinCfg[1] = IOPCTL0->PIO[1][0];
    pinCfg[2] = IOPCTL0->PIO[0][9];
#endif

    CLOCK_DisableClock(kCLOCK_Rtc);
    /* Power down unused modules. */
#if (DEMO_POWER_USE_PLL == 0U) /* PLL located in VDDN. */
    if (!IS_XIP_XSPI0() && !IS_XIP_XSPI1())
    {
        /* XSPI0 and XSPI1 memory interface located in VDDN_COM. */
        POWER_EnablePD(kPDRUNCFG_DSR_VDDN_COM);
        POWER_EnableRunRBB(kPower_BodyBiasVddn);
        POWER_EnablePD(kPDRUNCFG_SHUT_COMNN_MAINCLK);
        POWER_ApplyPD();
    }
#endif
    POWER_EnablePD(kPDRUNCFG_APD_OCOTP);
    POWER_ApplyPD();

    BOARD_DisableClocks();

